
## Plan Result (aat)




<pre><code>Plan: 22 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.postgres-v15-password
  * azurerm_key_vault_secret.postgres-v15-user
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;effective_cache_size&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;effective_io_concurrency&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;maintenance_work_mem&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;max_parallel_workers&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;max_parallel_workers_per_gather&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;max_wal_size&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;min_wal_size&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;random_page_cost&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;shared_buffers&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;wal_buffers&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;work_mem&#34;]
  * module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_database.pg_databases[&#34;camunda&#34;]
  * module.postgresql_flexible_expanded.azurerm_resource_group.rg[0]
  * module.postgresql_flexible_expanded.null_resource.set-user-permissions-additionaldbs[&#34;camunda&#34;]
  * module.postgresql_flexible_expanded.random_password.password
* Update
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.postgres-v15-password will be created
  + resource "azurerm_key_vault_secret" "postgres-v15-password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-aat/providers/Microsoft.KeyVault/vaults/camunda-aat"
      + name                    = "bpm-POSTGRES-V15-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.postgres-v15-user will be created
  + resource "azurerm_key_vault_secret" "postgres-v15-user" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-aat/providers/Microsoft.KeyVault/vaults/camunda-aat"
      + name                    = "bpm-POSTGRES-V15-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmcts-camunda-v14-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/hmcts-camunda-v14-flexible-aat"
        name                          = "hmcts-camunda-v14-flexible-aat"
        tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/camunda-bpm.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
        # (17 unchanged attributes hidden)

      + high_availability {
          + mode = "ZoneRedundant"
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "camundaadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Update"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "hmcts-camunda-v15-flexible-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "hmcts-camunda-v15-flexible-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 524288
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/camunda-bpm.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Software Engineering"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "hmcts-camunda-v15-flexible-data-aat"
      + server_name         = "hmcts-camunda-v15-flexible-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "hmcts-camunda-v15-flexible-data-aat"
      + server_name         = "hmcts-camunda-v15-flexible-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "PG_BUFFERCACHE,PG_STAT_STATEMENTS,PLPGSQL"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["effective_cache_size"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "effective_cache_size"
      + server_id = (known after apply)
      + value     = "3932160"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["effective_io_concurrency"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "effective_io_concurrency"
      + server_id = (known after apply)
      + value     = "200"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["maintenance_work_mem"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "maintenance_work_mem"
      + server_id = (known after apply)
      + value     = "512000"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["max_parallel_workers"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "max_parallel_workers"
      + server_id = (known after apply)
      + value     = "0"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["max_parallel_workers_per_gather"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "max_parallel_workers_per_gather"
      + server_id = (known after apply)
      + value     = "0"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["max_wal_size"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "max_wal_size"
      + server_id = (known after apply)
      + value     = "4096"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["min_wal_size"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "min_wal_size"
      + server_id = (known after apply)
      + value     = "1024"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["random_page_cost"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "random_page_cost"
      + server_id = (known after apply)
      + value     = "1.1"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["shared_buffers"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "shared_buffers"
      + server_id = (known after apply)
      + value     = "786432"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["wal_buffers"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "wal_buffers"
      + server_id = (known after apply)
      + value     = "16384"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["work_mem"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "work_mem"
      + server_id = (known after apply)
      + value     = "7489"
    }

  # module.postgresql_flexible_expanded.azurerm_postgresql_flexible_server_database.pg_databases["camunda"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "camunda"
      + server_id = (known after apply)
    }

  # module.postgresql_flexible_expanded.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "hmcts-camunda-v15-flexible-data-aat"
      + tags     = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/camunda-bpm.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Software Engineering"
        }
    }

  # module.postgresql_flexible_expanded.null_resource.set-user-permissions-additionaldbs["camunda"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = null
          + "name"           = "hmcts-camunda-v15-flexible"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgresql_flexible_expanded.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 22 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":802,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->